--[[
本文件由编辑器自动生成，如需修改请先修改Excel表格后再使用Unity生成本文件

金庸群侠传3D重制版
https://github.com/jynew/jynew

这是本开源项目文件头，所有代码均使用MIT协议。
但游戏内资源和第三方插件、dll等请仔细阅读LICENSE相关授权协议文档。

金庸老先生千古！
]]
local fieldIdx = {}
fieldIdx.Id = 1
fieldIdx.Name = 2
fieldIdx.MapScene = 3
fieldIdx.Exp = 4
fieldIdx.Music = 5
fieldIdx.TeamMates = 6
fieldIdx.AutoTeamMates = 7
fieldIdx.Enemies = 8
local data = {
{10,[[斗何云多]],[[00_Battle]],1000,23,{-1},{0},{10}},
{20,[[斗刘灯剑]],[[00_Battle]],1500,23,{-1},{0},{20}},
{21,[[斗童岿然]],[[00_Battle]],1500,23,{-1},{0,90},{21}},
{30,[[斗寿眉大师]],[[04_Battle]],2000,23,{0},{-1},{31}},
{31,[[斗虚寂]],[[04_Battle]],1000,23,{-1},{0},{30}},
{40,[[斗萨擎苍]],[[02_Battle]],1500,23,{0},{-1},{40}},
{41,[[双飞练武]],[[02_Battle]],2000,21,{0},{-1},{41,42}},
{60,[[斗王远]],[[03_Battle]],3000,22,{0},{-1},{60,62,63,64,65,66,67,68,69}},
{61,[[最终一战]],[[06_Battle]],3000,23,{0},{-1},{61,610,611,612,613,614,615,616,617,618,619}},
{70,[[斗曼陀谷弟子]],[[08_Battle]],1000,21,{0},{-1},{71,72}},
{90,[[斗牛不三]],[[05_Battle]],1000,21,{0},{-1},{91}},
{140,[[斗野狼]],[[01_Battle]],1000,22,{0},{-1},{140,141,142,143,144}},
{141,[[斗野狼]],[[01_Battle]],1000,22,{0},{-1},{140,141,142,143,144}},
{142,[[斗野狼]],[[01_Battle]],2000,22,{0},{-1},{140,141,142,143,144,145,146,147,148,149}},
{160,[[斗黑熊]],[[05_Battle]],1500,22,{0},{-1},{160}},
{161,[[斗黑熊]],[[05_Battle]],1500,22,{0},{-1},{161}},
{162,[[斗黑熊]],[[05_Battle]],1500,22,{0},{-1},{162}},
{163,[[斗黑熊]],[[05_Battle]],1500,22,{0},{-1},{163}},
{164,[[斗黑熊]],[[05_Battle]],1500,22,{0},{-1},{164}},
{165,[[斗巨型黑熊]],[[05_Battle]],2000,22,{0},{-1},{165}},
{180,[[斗毒蛇]],[[07_Battle]],1000,22,{0},{-1},{180,181}},
{181,[[斗毒蛇]],[[07_Battle]],1500,22,{0},{-1},{182,183,184}},
{190,[[比武招亲]],[[09_Battle]],2000,23,{-1},{11},{190}},
{191,[[比武招亲]],[[09_Battle]],2000,23,{-1},{11},{66}},
{192,[[比武招亲]],[[09_Battle]],2000,23,{-1},{11},{71}},
{193,[[比武招亲]],[[09_Battle]],2000,23,{-1},{11},{111}},
{194,[[比武招亲]],[[09_Battle]],2000,23,{-1},{11},{22}},
}
local helper = jy_utils.prequire('Jyx2Configs/BattleHelper')
local mt = {}
mt.__index = function(a,b)
	if fieldIdx[b] then
		return a[fieldIdx[b]]
	end
	if helper[b] then
		return helper[b]
	end
	return nil
end
mt.__metatable = false
for _,v in pairs(data) do
	setmetatable(v,mt)
end
local configMgr = Jyx2:GetModule('ConfigMgr')
configMgr:AddConfigTable([[Battle]], data)